data/azure/cyclecloud/cpu/256/node-147/raw/sysbench-fileio-run-file-test-modeseqwr
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential write (creation) test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     4529.03
    fsyncs/s:                     5801.64

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               70.77

General statistics:
    total time:                          10.0455s
    total number of events:              103657

Latency (ms):
         min:                                    0.00
         avg:                                    0.10
         max:                                   62.56
         95th percentile:                        0.02
         sum:                                10028.43

Threads fairness:
    events (avg/stddev):           103657.0000/0.00
    execution time (avg/stddev):   10.0284/0.00